MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32GG232F1024/mcu.h
/** @} End of group EFM32GG232F1024_PRS */

/***************************************************************************//**
 * @defgroup EFM32GG232F1024_UNLOCK EFM32GG232F1024 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */
#define BURTC_UNLOCK_CODE    0xAEE8 /**< BURTC unlock code */

/** @} End of group EFM32GG232F1024_UNLOCK */

/** @} End of group EFM32GG232F1024_BitFields */

/***************************************************************************//**
 * @defgroup EFM32GG232F1024_Alternate_Function EFM32GG232F1024 Alternate Function
 * @{
 ******************************************************************************/

// #include "efm32gg_af_ports.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg_af_pins.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFM32GG232F1024_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to up2026-05-29
 *  @param MASK
 *       The mask for the bit field to up2026-05-29
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFM32GG232F1024  */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EFM32GG232F1024_H */
